app/Helpers/my_helper.php

SELECT *
FROM `tbl_guru`
WHERE `nip` = '242135683'
SELECT *
FROM `tbl_rombel`
WHERE `id_guru` = '19'
---
function isWali()
{
  $db = \Config\Database::connect();
  $query = $db->table('tbl_guru')
    ->where('nip', session()->get('username'))
    ->get();

  if ($query->getRowArray() == null) {
    return false;
  }

  $id_guru = $query->getRowArray()['id_guru'];

  // id guru ada di tabel tbl_rombel
  $query = $db->table('tbl_rombel')
    ->where('id_guru', $id_guru)
    ->get();

SELECT *
FROM `tbl_guru`
WHERE `nip` = '242135683'
SELECT *
FROM `tbl_rombel`
WHERE `id_guru` = '19'
---
function urlPrintRaporWali()
{
  if (isWali()) {
    $db = \Config\Database::connect();
    $query = $db->table('tbl_guru')
      ->where('nip', session()->get('username'))
      ->get();

    if ($query->getRowArray() == null) {
      return '#';
    }

    $id_guru = $query->getRowArray()['id_guru'];

    $query = $db->table('tbl_rombel')
      ->where('id_guru', $id_guru)
      ->get();