app/Models/ModelSiswa.php

    public function SiswaByRombel($id_rombel)
    {
        return $this->db->table('tbl_siswa')
            ->where('id_rombel', $id_rombel)
            ->orderBy('nama_siswa', 'ASC')
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_siswa`
WHERE `id_rombel` = '1'
ORDER BY `nama_siswa` ASC

    public function NilaiBySiswa($id_siswa, $id_jadwal)
    {
        return $this->db->table('tbl_penilaian')
            ->where('id_siswa', $id_siswa)
            ->where('id_jadwal', $id_jadwal)
            ->get()->getRowArray();
---
SELECT *
FROM `tbl_penilaian`
WHERE `id_siswa` = '13'
AND `id_jadwal` = '11'