app/Models/ModelDashboardGuru.php

SELECT *
FROM `tbl_guru`
WHERE `nip` = '242135683'
---
    public function DataGuru(){
        return $this->db->table('tbl_guru')
        ->where('nip', session()->get('username'))
        ->get()->getRowArray();

SELECT *
FROM `tbl_jadwal`
LEFT JOIN `tbl_mapel` ON `tbl_mapel`.`id_mapel` = `tbl_jadwal`.`id_mapel`
LEFT JOIN `tbl_rombel` ON `tbl_rombel`.`id_rombel` = `tbl_jadwal`.`id_rombel`
WHERE `tbl_jadwal`.`id_guru` = '19'
---
    public function JadwalGuru($id_guru)
    {
        return $this->db->table('tbl_jadwal')
        ->join('tbl_mapel', 'tbl_mapel.id_mapel = tbl_jadwal.id_mapel', 'left')
        ->join('tbl_rombel', 'tbl_rombel.id_rombel = tbl_jadwal.id_rombel', 'left')
        ->where('tbl_jadwal.id_guru', $id_guru)
        ->get()->getResultArray();