app/Models/ModelDashboard.php

SELECT COUNT(*) AS `numrows` FROM `tbl_rombel`
---
    public function jml_rombel()
    {
        return $this->db->table('tbl_rombel')
        ->countAll();

SELECT COUNT(*) AS `numrows` FROM `tbl_jurusan`
---
    public function jml_jurusan()
    {
        return $this->db->table('tbl_jurusan')
        ->countAll();

SELECT COUNT(*) AS `numrows` FROM `tbl_guru`
---
    public function jml_guru()
    {
        return $this->db->table('tbl_guru')
        ->countAll();

SELECT COUNT(*) AS `numrows` FROM `tbl_siswa`
---
    public function jml_siswa()
    {
        return $this->db->table('tbl_siswa')
        ->countAll();