app/Models/ModelNilai.php

    public function DetailJadwal($id_jadwal)
    {
        return $this->db->table('tbl_jadwal')
            ->join('tbl_mapel', 'tbl_mapel.id_mapel = tbl_jadwal.id_mapel', 'left')
            ->join('tbl_guru', 'tbl_guru.id_guru = tbl_jadwal.id_guru', 'left')
            ->join('tbl_rombel', 'tbl_rombel.id_rombel = tbl_jadwal.id_rombel', 'left')
            ->join('tbl_jurusan', 'tbl_jurusan.id_jurusan = tbl_jadwal.id_jurusan', 'left')
            ->where('tbl_jadwal.id_jadwal', $id_jadwal)
            ->get()
            ->getRowArray();
---
SELECT *
FROM `tbl_jadwal`
LEFT JOIN `tbl_mapel` ON `tbl_mapel`.`id_mapel` = `tbl_jadwal`.`id_mapel`
LEFT JOIN `tbl_guru` ON `tbl_guru`.`id_guru` = `tbl_jadwal`.`id_guru`
LEFT JOIN `tbl_rombel` ON `tbl_rombel`.`id_rombel` = `tbl_jadwal`.`id_rombel`
LEFT JOIN `tbl_jurusan` ON `tbl_jurusan`.`id_jurusan` = `tbl_jadwal`.`id_jurusan`
WHERE `tbl_jadwal`.`id_jadwal` = '11'

    public function NilaiBySiswa($id_ta, $id_siswa)
    {
        return $this->db->table('tbl_penilaian')
            ->join('tbl_jadwal', 'tbl_jadwal.id_jadwal = tbl_penilaian.id_jadwal', 'left')
            ->join('tbl_mapel', 'tbl_mapel.id_mapel = tbl_jadwal.id_mapel', 'left')
            ->join('tbl_guru', 'tbl_guru.id_guru = tbl_jadwal.id_guru', 'left')
            ->join('tbl_rombel', 'tbl_rombel.id_rombel = tbl_jadwal.id_rombel', 'left')
            ->where('tbl_penilaian.id_ta', $id_ta)
            ->where('tbl_penilaian.id_siswa', $id_siswa)
            ->get()
            ->getResultArray();
---
SELECT *
FROM `tbl_penilaian`
LEFT JOIN `tbl_jadwal` ON `tbl_jadwal`.`id_jadwal` = `tbl_penilaian`.`id_jadwal`
LEFT JOIN `tbl_mapel` ON `tbl_mapel`.`id_mapel` = `tbl_jadwal`.`id_mapel`
LEFT JOIN `tbl_guru` ON `tbl_guru`.`id_guru` = `tbl_jadwal`.`id_guru`
LEFT JOIN `tbl_rombel` ON `tbl_rombel`.`id_rombel` = `tbl_jadwal`.`id_rombel`
WHERE `tbl_penilaian`.`id_ta` = '1'
AND `tbl_penilaian`.`id_siswa` = '12'