app/Models/ModelAuth.php

    public function LoginUser($username, $password)
    {

        return $this->db->table('tbl_user')
        ->where('username', $username)
        ->where('password', $password)
        ->get()->getRowArray();
---
SELECT *
FROM `tbl_user`
WHERE `username` = 'admin'
AND `password` = 'admin'

    public function LoginGuru($username, $password)
    {

        return $this->db->table('tbl_guru')
        ->where([
            'nip'   =>$username,
            'password'  => $password,
        ])
        ->get()->getRowArray();
---
SELECT *
FROM `tbl_guru`
WHERE `nip` = '242135681'
AND `password` = '1234'

    public function LoginSiswa($username, $password)
    {

        return $this->db->table('tbl_siswa')
        ->where([
            'NIS'   =>$username,
            'password'  => $password,
        ])
        ->get()->getRowArray();
---
SELECT *
FROM `tbl_siswa`
WHERE `NIS` = '5430'
AND `password` = '1234'