app/Models/ModelTa.php

SELECT *
FROM `tbl_ta`
WHERE `status` = 1
---
    public function TaAktif()
    {
        return $this->db->table('tbl_ta')
        ->where('status', 1)
        ->get()->getRowArray();